[
    {
        "id": "hawking",
        "flavor": "code",
        "name": "Hawking",
        "description": [
            "Hawking is a retro text-to-speech bot for Discord that lets users interact with each other using the text-to-speech engine made famous by Stephen Hawking.",
            "Give it a shot and <a href='https://discordapp.com/oauth2/authorize?client_id=334894709292007424&scope=bot&permissions=53803072' target='_blank'>add Hawking your Discord server</a> now, or <a href='https://discord.gg/JJqx8C4' target='_blank'>play around with it on my server</a>!"
        ],
        "url": "https://github.com/naschorr/hawking",
        "funFacts": [
            "More than 3 million messages spoken",
            "Active in more than 2,800 servers"
        ],
        "technologies": [
            "Python",
            "discord.py",
            "FFmpeg",
            "AWS EC2",
            "AWS DynamoDB"
        ]
    },
    {
        "id": "drgss",
        "flavor": "code",
        "name": "Deep Rock Galactic Save Syncer",
        "description": [
            "Deep Rock Galactic (DRG) is an excellent co-op survival game, however it's got a major flaw: the game isn't cross platform. This makes it hard to play with friends who aren't on the same platform.",
            "Thus Deep Rock Galactic Save Syncer (DRGSS) was born! DRGSS is a user friendly desktop app that lets you sync your save files between Steam and Xbox installations of DRG without any fuss!",
            "Designed to be as easy to use as possible, DRGSS provides a single click solution to get save files synced up between the platforms, while being transparent and fault tolerant to keep those precious save files safe.",
            "Grab the <a href='https://github.com/naschorr/deep-rock-galactic-save-syncer/releases' target='_blank'>latest release</a> now!"
        ],
        "images": [
            {
                "url": "assets/images/projects/deep-rock-galactic-save-syncer/ui.avif",
                "description": [
                    "The UI for Deep Rock Galactic Save Syncer, designed it to be as simple to use as possible.",
                    "Note that it's instantly ready to sync your save files with a single click of that big button at the bottom!"
                ],
                "altText": "A screenshot of the Deep Rock Galactic Save Syncer UI."
            },
            {
                "url": "assets/images/projects/deep-rock-galactic-save-syncer/ui-inspiration.avif",
                "description": [
                    "A screenshot of the game's UI. I tried to make the UI for Deep Rock Galactic Save Syncer feel like it came from within the game itself."
                ],
                "altText": "A screenshot of the Deep Rock Galactic UI, used as inspiration."
            },
            {
                "url": "assets/images/projects/deep-rock-galactic-save-syncer/ui-missing-xbox-save.avif",
                "description": [
                    "I wanted to make sure that even if something went wrong, the user would be able to easily understand what happened.",
                    "Here's an example of what happens when the Xbox save file is missing, and the user tries to sync it to Steam."
                ],
                "altText": "A screenshot of the Deep Rock Galactic Save Syncer UI, showing an error that the Xbox save file couldn't be found."
            },
            {
                "url": "assets/images/projects/deep-rock-galactic-save-syncer/button-explainer.avif",
                "description": [
                    "The big button at the bottom of the UI is meant to present a lot of information in a simple way to the user.",
                    "Here's a rundown of the various states the button can be in, and what they all mean."
                ],
                "altText": "An image showing the various states the sync button can be in, and what they mean."
            }
        ],
        "url": "https://github.com/naschorr/deep-rock-galactic-save-syncer",
        "technologies": [
            "C#",
            ".NET 7",
            "Blazor",
            "Moq",
            "xUnit",
            "Electron.NET",
            "GitHub Actions"
        ]
    },
    {
        "id": "mail-to-sms",
        "flavor": "code",
        "name": "Mail To SMS",
        "description": [
            "Programmatically send out SMS messages using email! Mail To SMS is simple to integrate, and offers an easy to use CLI to support scripting too."
        ],
        "url": "https://github.com/naschorr/mail-to-sms",
        "technologies": [
            "Python",
            "unittest",
            "Click",
            "PyPI"
        ]
    },
    {
        "id": "website",
        "flavor": "code",
        "name": "nickschorr.com",
        "description": [
            "You're looking at it right now! This is my personal website which is used to show off what I've been working on, link to the places that host my projects, and serve as a playground for general webdev fun."
        ],
        "url": "https://github.com/naschorr/naschorr.github.io",
        "technologies": [
            "Angular 20",
            "TypeScript",
            "Tailwind CSS",
            "npm CLI",
            "Cloudflare",
            "GitHub Actions"
        ]
    },
    {
        "id": "spotify-scraper",
        "flavor": "code",
        "name": "Spotify Scraper",
        "description": [
            "A Python API for getting the artist, song, and album art for the currently playing song on Spotify."
        ],
        "url": "https://github.com/naschorr/spotify-scraper",
        "technologies": [
            "Python",
            "PyWin32"
        ]
    },
    {
        "id": "parts-organizer",
        "flavor": "3dprint",
        "name": "Small Parts Organizer Ecosystem",
        "description": [
            "Affordable, modular, customizable 3D printed small parts organizers!",
            "Harbor Freight sells a <a href='https://www.harborfreight.com/20-Bin-Medium-Portable-Parts-Storage-Case-93928.html' target='_blank'>20-bin parts storage case</a> that's almost perfect for organizing small parts. The only issue is that the bins that come with the case are of poor quality, and aren't sized properly for lots of small parts.",
            "This work in progress project is a set of 3D printable bins that are designed to perfectly fit in the case, a set of labels to list the contents of each bin, and a set of alignment grids that slot into the case itself to keep the bins in place. Additionally, new labels can be generated on the fly with a script that takes in a list of JSON objects, and outputs a STL file corresponding to each label."
        ],
        "images": [
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/m3_assorted.avif",
                "description": [
                    "Here's a bunch of bins filled with M3 hardware, labelled with custom tags generated programatically."
                ],
                "altText": "A photo of an assortment of custom bins filled with M3 hardware."
            },
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/m3s_16_lid_open.avif",
                "description": [
                    "Here's a closer look at a small bin full of M3 16mm countersunk screws."
                ],
                "altText": "A photo of a small bin full of M3 16mm countersunk screws."
            },
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/m3s_16_lid_closed.avif",
                "description": [
                    "The bins themselves are designed to use the alignment features of the case itself.",
                    "This helps to secure them from the top, and when combined with my alignment grids below, prevents them from moving around at all."
                ],
                "altText": "A photo of a small bin full of M3 16mm countersunk screws, but with the lid closed."
            },
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/m8n_m8s_double.avif",
                "description": [
                    "Bins come in a variety of sizes, to help store all kinds of different parts.",
                    "Here's an extra-large bin filled with M8 knobs and M8 100mm carriage bolts."
                ],
                "altText": "A photo of a large bin filled with M8 knobs and M8 100mm carriage bolts."
            },
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/tag_removal.avif",
                "description": [
                    "Labels can be swapped out easily, just pop them out by pressing a screwdriver or an M4 or smaller bolt through the hole in the back."
                ],
                "altText": "A photo of a small bin having its label removed with a screwdriver pushed through the hole in the back."
            },
            {
                "url": "assets/images/projects/harbor-freight-storage-bin-upgrade/bin_features.avif",
                "description": [
                    "The bins themselves are designed for both ease of use, and ease of printing."
                ],
                "altText": "An infographic of a cutaway of a single bin, showing some of the features of the design."
            }
        ],
        "url": null,
        "technologies": [
            "Autodesk Fusion",
            "OpenSCAD",
            "Python",
            "Pydantic"
        ]
    },
    {
        "id": "nixie-clock-case",
        "flavor": "3dprint",
        "name": "Minimal Nixie Tube Clock Case",
        "description": [
            "A small UK based company sells this excellent <a href='https://www.pvelectronics.co.uk/index.php?main_page=product_info&cPath=21&products_id=71' target='_blank'>DIY nixie tube clock kit</a> based around the IN-14 nixie tube. The problem is that their official case options don't really fit my vibe, so I decided to design my own!",
            "This is a clean, minimal case that's designed for really easy printing, minimal post-processing and easy assembly. As a bonus, it has extra space for the official <a href='https://www.pvelectronics.co.uk/index.php?main_page=product_info&cPath=9&products_id=318' target='_blank'> Wifi NTP sync module</a> that the company offers and storage slots for the nixie tube quick change PCBs that the clock uses."
        ],
        "images": [
            {
                "url": "assets/images/projects/nixie-clock/case_front.avif",
                "description": [
                    "The clock installed into the case."
                ],
                "altText": "A photo of the case from the front, the clock is on and is displaying random numbers."
            },
            {
                "url": "assets/images/projects/nixie-clock/case_rear.avif",
                "description": [
                    "The clock case from the rear, with the Wifi NTP sync module installed and connected."
                ],
                "altText": "A photo of the case from the rear, with the Wifi NTP sync module installed."
            },
            {
                "url": "assets/images/projects/nixie-clock/parts_needed.avif",
                "description": [
                    "The parts needed to assemble the case.",
                    "The case_top part uses M3 threaded inserts, and weight is added using 24 lead fishing weights and hot glue.",
                    "The case_bottom part uses 6mm countersunk M3 screws to secure the QTC PCBs in place, and 12mm countersunk M3 screws to connect the top and bottom parts together. Small 1/2 inch rubber feet have been added to keep the clock from sliding around."
                ],
                "altText": "A top-down photo of the printed parts and store-bought parts needed to build this clock case."
            },
            {
                "url": "assets/images/projects/nixie-clock/case_bottom_inside.avif",
                "description": [
                    "The assembled bottom of the case, showing the QTC PCBs installed and secured."
                ],
                "altText": "A photo of the inside of the bottom of the clock case, with QTC PCBs installed."
            },
            {
                "url": "assets/images/projects/nixie-clock/clock_installation.avif",
                "description": [
                    "Here's the clock and Wifi NTP sync module installed into the top of the case."
                ],
                "altText": "A photo of the inside of the case, with the clock and Wifi NTP sync module installed."
            },
            {
                "url": "assets/images/projects/nixie-clock/case_bottom.avif",
                "description": [
                    "The bottom of the assembled clock case."
                ],
                "altText": "A photo of the bottom of the assembled clock case."
            }
        ],
        "url": null,
        "technologies": [
            "Autodesk Fusion"
        ]
    },
    {
        "id": "mtb-brake-spacer",
        "flavor": "3dprint",
        "name": "Disc Brake Spacer for Mountain Bikes",
        "description": [
            "Keep your bike's brake pads separated when removing the wheel with this simple spacer!",
            "Designed for Shimano MT200 brakes, but should play nice with other mountain bike disc brakes."
        ],
        "images": [
            {
                "url": "assets/images/projects/mtb-disc-brake-spacer/spacer.avif",
                "description": [
                    "The spacer itself, with the line clipped into the bottom hole."
                ],
                "altText": "A photo of the disc brake spacer lying in front of prototypes."
            },
            {
                "url": "assets/images/projects/mtb-disc-brake-spacer/installed.avif",
                "description": [
                    "The spacer, installed into a mountain bike's rear caliper."
                ],
                "altText": "A photo of the disc brake spacer installed."
            },
            {
                "url": "assets/images/projects/mtb-disc-brake-spacer/overlay.avif",
                "description": [
                    "The spacer, installed and with the line clipped in locking it in place. An overlay has been added to better illustrate what the the installation looks like."
                ],
                "altText": "A photo of the disc brake spacer installed, with an overlay of all the components."
            }
        ],
        "url": null,
        "technologies": [
            "Autodesk Fusion"
        ]
    },
    {
        "id": "mtb-inflator-carrier-magnetic",
        "flavor": "3dprint",
        "name": "CO2 Inflator Carrier for Mountain Bike Steer Tubes",
        "description": [
            "Magnetically carry your 16g CO2 cartridge and <a href='https://www.trekbikes.com/us/en_US/equipment/bike-accessories/bike-pumps-accessories/bike-pumps/bontrager-air-rush-elite-co-inflator/p/24237/'>Bontrager Air Rush Elite inflator</a> inside your <a href='https://www.sram.com/en/rockshox/series/recon'>RockShox Recon</a> steer tube (or potentially other forks with a 1.5\" tapered steer tube)!",
            "Mountain bikes don't usually have a ton of storage space on them, so I designed this carrier to fit inside the normally wasted space of a bike's steer tube. As a bonus, this assembly holds the CO2 cartridge and inflator in place using magnets, so they're easy to reach if you need them in a hurry."
        ],
        "images": [
            {
                "url": "assets/images/projects/mtb-inflator-carrier-magnetic/in_use.avif",
                "description": [
                    "The inflator carrier in use, with just the handle poking out of the bottom of the mountain bike's steer tube."
                ],
                "altText": "A photo of the inflator carrier in use, with just the handle poking out of the bottom of the mountain bike's steer tube."
            },
            {
                "url": "assets/images/projects/mtb-inflator-carrier-magnetic/assembly.avif",
                "description": [
                    "A render of the completed assembly. On the left is the Bontrager inflator, clipped into it's holder. The holder is screwed onto the CO2 cartridge. The CO2 cartridge is magnetically attached to the CO2 cartridge mount, which is screwed into the compression plug assembly.",
                    "The total package is slim, easy to assemble, and easy to print."
                ],
                "altText": "A photo of the entire CO2 inflator assembly with it's magnetic mount and compression plug for the steer tube."
            },
            {
                "url": "assets/images/projects/mtb-inflator-carrier-magnetic/co2_inflator_holder.avif",
                "description": [
                    "A close up of the CO2 inflator inside its holder, screwed onto the CO2 cartridge."
                ],
                "altText": "A close photo up of the CO2 inflator inside its holder, screwed onto the CO2 cartridge."
            },
            {
                "url": "assets/images/projects/mtb-inflator-carrier-magnetic/compression_plug_co2_mount.avif",
                "description": [
                    "A close up of the CO2 cartridge mount and compression plug assembly.",
                    "During assembly, the compression plug's screw is tightened which brings the upper and lower \"cones\" together. This causes the wedges in between them to expand outward, driving the o-rings into the inside of the steer tube, and locking it in place."
                ],
                "altText": "A close up of the CO2 cartridge mount and compression plug assembly."
            }
        ],
        "url": "https://www.printables.com/model/1153275",
        "technologies": [
            "Autodesk Fusion"
        ]
    }
]